In [1]:
#import necessary library
import numpy as np # linear algebra
import pandas as pd # data manipulation and analysis
import matplotlib.pyplot as plt # data visualization
import seaborn as sns # data visualization
sns.set_style('whitegrid') # set style for visualization
import warnings # ignore warnings
warnings.filterwarnings('ignore')

from initial_report import *

In [2]:
#import customer data
df_customer=pd.read_csv("cleaned_customer_data.csv")

In [3]:
#check df_customer sample
df_customer.sample(5)

                            customer_id became_member_on gender  age    income
14528  27e698850e99408abf02b46f834083f5       2017-09-20      F   74  104000.0
9779   8422716ca87044e794939f102092c428       2017-02-26      F   75   82000.0
6197   7f7278ffc3d44f85a1082dec893be26f       2017-01-28      F   20   71000.0
9193   4d8589d290e440c3b314b59b4443e5e8       2017-08-13      M   22   45000.0
2775   cc2b8bc0fed04953950251e39fd053fa       2017-02-18      F   61   73000.0

In [4]:
#get initial report
initial_report(df_customer)

 *** DATA CLEANING CHECKLIST ***
----------------------------------------
*** Structure:
- Total Rows: 14825
- Total Columns: 5
- Column Names: ['customer_id', 'became_member_on', 'gender', 'age', 'income']

*** Data Types:
  customer_id: object
  became_member_on: object
  gender: object
  age: int64
  income: float64

*** Mixed Data Types:

*** Distinct Values per Column:
  customer_id: 14825
  became_member_on: 1707
  gender: 3
  age: 84
  income: 91

*** Null Values and Percentages:


*** Duplicates: 0

*** Negative or Zero Values:

*** Basic Statistics:
                age         income
count  14825.000000   14825.000000
mean      54.393524   65404.991568
std       17.383705   21598.299410
min       18.000000   30000.000000
25%       42.000000   49000.000000
50%       55.000000   64000.000000
75%       66.000000   80000.000000
max      101.000000  120000.000000

*** Category Description:
                             customer_id became_member_on gender
count                              14825            14825  14825
unique                             14825             1707      3
top     e4052622e5ba45a8b96b59aba68cf068       2017-08-19      M
freq                                   1               39   8484

*** Outliers (IQR method):
  age: No outliers
    Lower Bound: 6.00
    Upper Bound: 102.00
  income: No outliers
    Lower Bound: 2500.00
    Upper Bound: 126500.00
----------------------------------------

1. became_member_on is date column

In [5]:
# Convert 'became_member_on' to datetime
df_customer['became_member_on'] = pd.to_datetime(df_customer['became_member_on'])
print(df_customer['became_member_on'].dtype)

datetime64[ns]

In [6]:
#check higest age and lowest age
print(df_customer.age.min(),df_customer.age.max())

18 101

In [7]:
#check highest and lowest income
print(df_customer.income.min(),df_customer.income.max())

30000.0 120000.0

In [8]:
# create bin for grouped analysis
df_customer['age_group'] = pd.cut(df_customer['age'], bins=[0, 30, 45, 60, 101], labels=['<30', '30-45', '45-60', '60+'])
df_customer['income_group'] = pd.qcut(df_customer['income'], q=4, labels=['low', 'mid-Low', 'mid-high', 'high'])
df_customer['membership_year'] = df_customer['became_member_on'].astype(str).str[:4].astype(int)
df_customer.sample(5)

,customer_id,became_member_on,gender,age,income,age_group,income_group,membership_year
6326,66016c0bd39a45dfb7a90e0d4ba5a839,2017-11-23,F,59,91000.0,45-60,high,2017
8372,bfe8855ff5f34cf6a8e7ce556b0e7e73,2015-12-02,F,69,56000.0,60+,mid-Low,2015
3198,3403ae9e2e7943a6a4cf242471c66e6f,2017-10-12,M,42,86000.0,30-45,high,2017
5740,960d6648706f4b3094de92779c8ff802,2018-02-25,M,58,34000.0,45-60,low,2018
7389,7ccf7223c7e74779942493f85fee6b6d,2014-05-18,M,51,63000.0,45-60,mid-Low,2014

In [9]:
#drop unnecessary columns
df_customer_trimmed = df_customer.drop(columns=['became_member_on', 'age', "income"])
df_customer_trimmed.sample(5)

,customer_id,gender,age_group,income_group,membership_year
2039,d7f751dd8f824d94953dcdc0f79c7345,F,45-60,high,2015
6685,e6d9da82e0bf4894a8570374f87f0588,F,60+,high,2017
6792,f4996c5638134185b27f27e8bb0adaf1,M,45-60,mid-high,2018
4332,2eb00c21064745de9a81539ded506dca,F,60+,mid-high,2017
12569,825c2c2bb7aa4f29b1e882f40f0f8250,M,45-60,mid-Low,2015

In [10]:
#check value counts for age group
df_customer_trimmed.age_group.value_counts()

age_group
60+      5542
45-60    4927
30-45    2651
<30      1705
Name: count, dtype: int64

In [11]:
#check value counts for income group
df_customer_trimmed.income_group.value_counts()

income_group
mid-Low     3863
low         3781
mid-high    3616
high        3565
Name: count, dtype: int64

In [12]:
#check value counts for membership year
df_customer_trimmed.membership_year.value_counts()

membership_year
2017    5599
2018    3669
2016    3024
2015    1597
2014     662
2013     274
Name: count, dtype: int64

In [13]:
#load df offer
df_offer=pd.read_csv("cleaned_offers.csv")

In [14]:
#show sample
df_offer.sample(5)

,offer_id,offer_type,difficulty,reward,duration,web,email,mobile,social
3,9b98b8c7a33c4b65b9aebfe6a799e6d9,bogo,5,5,7,1,1,1,0
0,ae264e3637204a6fb9bb56bc8210ddfd,bogo,10,10,7,0,1,1,1
6,fafdcd668e3743c1bb461111dcafc2a4,discount,10,2,10,1,1,1,1
5,2298d6c36e964ae4a3e7e9706d1fb8c2,discount,7,3,7,1,1,1,1
1,4d5c57ea9a6940dd891ad53e9dbe8da0,bogo,10,10,5,1,1,1,1

In [15]:
#get initial report
initial_report(df_offer)

 *** DATA CLEANING CHECKLIST ***
----------------------------------------
*** Structure:
- Total Rows: 10
- Total Columns: 9
- Column Names: ['offer_id', 'offer_type', 'difficulty', 'reward', 'duration', 'web', 'email', 'mobile', 'social']

*** Data Types:
  offer_id: object
  offer_type: object
  difficulty: int64
  reward: int64
  duration: int64
  web: int64
  email: int64
  mobile: int64
  social: int64

*** Mixed Data Types:

*** Distinct Values per Column:
  offer_id: 10
  offer_type: 3
  difficulty: 5
  reward: 5
  duration: 5
  web: 2
  email: 1
  mobile: 2
  social: 2

*** Null Values and Percentages:


*** Duplicates: 0
ðŸ§± Constant Columns (no variance): ['email']

*** Negative or Zero Values:
  difficulty: 2
  reward: 2
  web: 2
  mobile: 1
  social: 4

*** Basic Statistics:
       difficulty     reward   duration        web  email     mobile  \
count   10.000000  10.000000  10.000000  10.000000   10.0  10.000000
mean     7.700000   4.200000   6.500000   0.800000    1.0   0.900000
std      5.831905   3.583915   2.321398   0.421637    0.0   0.316228
min      0.000000   0.000000   3.000000   0.000000    1.0   0.000000
25%      5.000000   2.000000   5.000000   1.000000    1.0   1.000000
50%      8.500000   4.000000   7.000000   1.000000    1.0   1.000000
75%     10.000000   5.000000   7.000000   1.000000    1.0   1.000000
max     20.000000  10.000000  10.000000   1.000000    1.0   1.000000

          social
count  10.000000
mean    0.600000
std     0.516398
min     0.000000
25%     0.000000
50%     1.000000
75%     1.000000
max     1.000000

*** Category Description:
                                offer_id offer_type
count                                 10         10
unique                                10          3
top     ae264e3637204a6fb9bb56bc8210ddfd       bogo
freq                                   1          4

*** Outliers (IQR method):
  difficulty: 1 outliers
    Lower Bound: -2.50
    Upper Bound: 17.50
  reward: 2 outliers
    Lower Bound: -2.50
    Upper Bound: 9.50
  duration: No outliers
    Lower Bound: 2.00
    Upper Bound: 10.00
  web: 2 outliers
    Lower Bound: 1.00
    Upper Bound: 1.00
  email: No outliers
    Lower Bound: 1.00
    Upper Bound: 1.00
  mobile: 1 outliers
    Lower Bound: 1.00
    Upper Bound: 1.00
  social: No outliers
    Lower Bound: -1.50
    Upper Bound: 2.50
----------------------------------------

In [16]:
#create offer_combo by adding offer_type, difficulty, reward, duration
df_offer['offer_combo'] = (
    df_offer['offer_type'].astype(str) + '-' +
    df_offer['difficulty'].astype(str) + '-' +
    df_offer['reward'].astype(str) + '-' +
    df_offer['duration'].astype(str)
)
df_offer.sample(5)

,offer_id,offer_type,difficulty,reward,duration,web,email,mobile,social,offer_combo
7,5a8bc65990b245e5a138643cd4eb9837,informational,0,0,3,0,1,1,1,informational-0-0-3
4,0b1e1539f2cc45b7b9fa7c272da2e1d7,discount,20,5,10,1,1,0,0,discount-20-5-10
8,f19421c1d4aa40978ebb69ca19b0e20d,bogo,5,5,5,1,1,1,1,bogo-5-5-5
9,2906b810c7d4411798c6938adc9daaa5,discount,10,2,7,1,1,1,0,discount-10-2-7
5,2298d6c36e964ae4a3e7e9706d1fb8c2,discount,7,3,7,1,1,1,1,discount-7-3-7

In [17]:
#drop unnecessary columns
df_offer_trimmed = df_offer.drop(columns=['offer_type', 'difficulty', "reward","duration"])
df_offer_trimmed

,offer_id,web,email,mobile,social,offer_combo
0,ae264e3637204a6fb9bb56bc8210ddfd,0,1,1,1,bogo-10-10-7
1,4d5c57ea9a6940dd891ad53e9dbe8da0,1,1,1,1,bogo-10-10-5
2,3f207df678b143eea3cee63160fa8bed,1,1,1,0,informational-0-0-4
3,9b98b8c7a33c4b65b9aebfe6a799e6d9,1,1,1,0,bogo-5-5-7
4,0b1e1539f2cc45b7b9fa7c272da2e1d7,1,1,0,0,discount-20-5-10
5,2298d6c36e964ae4a3e7e9706d1fb8c2,1,1,1,1,discount-7-3-7
6,fafdcd668e3743c1bb461111dcafc2a4,1,1,1,1,discount-10-2-10
7,5a8bc65990b245e5a138643cd4eb9837,0,1,1,1,informational-0-0-3
8,f19421c1d4aa40978ebb69ca19b0e20d,1,1,1,1,bogo-5-5-5
9,2906b810c7d4411798c6938adc9daaa5,1,1,1,0,discount-10-2-7

In [18]:
#load df_event
df_event=pd.read_csv("cleaned_events.csv")
df_event

,customer_id,event,time,offer_id,amount,reward
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,0,9b98b8c7a33c4b65b9aebfe6a799e6d9,NaN,NaN
1,a03223e636434f42ac4c3df47e8bac43,offer received,0,0b1e1539f2cc45b7b9fa7c272da2e1d7,NaN,NaN
2,e2127556f4f64592b11af22de27a7932,offer received,0,2906b810c7d4411798c6938adc9daaa5,NaN,NaN
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,0,fafdcd668e3743c1bb461111dcafc2a4,NaN,NaN
4,68617ca6246f4fbc85e91a2a49552598,offer received,0,4d5c57ea9a6940dd891ad53e9dbe8da0,NaN,NaN
...,...,...,...,...,...,...
306132,b3a1272bc9904337b331bf348c3e8c17,transaction,714,NaN,1.59,NaN
306133,68213b08d99a4ae1b0dcb72aebd9aa35,transaction,714,NaN,9.53,NaN
306134,a00058cf10334a308c68e7631c529907,transaction,714,NaN,3.61,NaN
306135,76ddbd6576844afe811f1a3c0fbb5bec,transaction,714,NaN,3.53,NaN
306136,c02b10e8752c4d8e9b73f918558531f7,transaction,714,NaN,4.05,NaN

In [19]:
df_event_no_tran=df_event[df_event.event!="transaction"]
df_event_no_tran

,customer_id,event,time,offer_id,amount,reward
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,0,9b98b8c7a33c4b65b9aebfe6a799e6d9,NaN,NaN
1,a03223e636434f42ac4c3df47e8bac43,offer received,0,0b1e1539f2cc45b7b9fa7c272da2e1d7,NaN,NaN
2,e2127556f4f64592b11af22de27a7932,offer received,0,2906b810c7d4411798c6938adc9daaa5,NaN,NaN
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,0,fafdcd668e3743c1bb461111dcafc2a4,NaN,NaN
4,68617ca6246f4fbc85e91a2a49552598,offer received,0,4d5c57ea9a6940dd891ad53e9dbe8da0,NaN,NaN
...,...,...,...,...,...,...
306100,a6f84f4e976f44508c358cc9aba6d2b3,offer completed,714,2298d6c36e964ae4a3e7e9706d1fb8c2,NaN,3.0
306109,b895c57e8cd047a8872ce02aa54759d6,offer completed,714,fafdcd668e3743c1bb461111dcafc2a4,NaN,2.0
306110,8dda575c2a1d44b9ac8e8b07b93d1f8e,offer viewed,714,0b1e1539f2cc45b7b9fa7c272da2e1d7,NaN,NaN
306112,8431c16f8e1d440880db371a68f82dd0,offer completed,714,fafdcd668e3743c1bb461111dcafc2a4,NaN,2.0
306130,24f56b5e1849462093931b164eb803b5,offer completed,714,fafdcd668e3743c1bb461111dcafc2a4,NaN,2.0

In [22]:
df_event_no_tran.event.value_counts()

event
offer received     76277
offer viewed       57725
offer completed    33182
Name: count, dtype: int64

In [20]:
import pandas as pd

# Step 1: Sort the DataFrame by time
df_event_sorted = df_event_no_tran.sort_values(by='time')

# Step 2: Pivot the DataFrame to wide format
df_pivot = df_event_sorted.pivot_table(
    index=['customer_id', 'offer_id'],
    columns='event',
    values='time'
).reset_index()

# Step 3: Rename the columns
df_pivot = df_pivot.rename(columns={
    'offer received': 'received_time',
    'offer viewed': 'viewed_time',
    'offer completed': 'completed_time'
})

# Optional: Ensure column order
df_pivot = df_pivot[['customer_id', 'offer_id', 'received_time', 'viewed_time', 'completed_time']]
df_pivot

event,customer_id,offer_id,received_time,viewed_time,completed_time
0,0009655768c64bdeb2e877511632db8f,2906b810c7d4411798c6938adc9daaa5,576.0,NaN,576.0
1,0009655768c64bdeb2e877511632db8f,3f207df678b143eea3cee63160fa8bed,336.0,372.0,NaN
2,0009655768c64bdeb2e877511632db8f,5a8bc65990b245e5a138643cd4eb9837,168.0,192.0,NaN
3,0009655768c64bdeb2e877511632db8f,f19421c1d4aa40978ebb69ca19b0e20d,408.0,456.0,414.0
4,0009655768c64bdeb2e877511632db8f,fafdcd668e3743c1bb461111dcafc2a4,504.0,540.0,528.0
...,...,...,...,...,...
63283,fffad4f4828548d1b5583907f2e9906b,f19421c1d4aa40978ebb69ca19b0e20d,204.0,258.0,276.0
63284,ffff82501cea40309d5fdd7edcca4a07,0b1e1539f2cc45b7b9fa7c272da2e1d7,168.0,174.0,198.0
63285,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,440.0,450.0,458.0
63286,ffff82501cea40309d5fdd7edcca4a07,9b98b8c7a33c4b65b9aebfe6a799e6d9,504.0,534.0,504.0
63287,ffff82501cea40309d5fdd7edcca4a07,fafdcd668e3743c1bb461111dcafc2a4,0.0,6.0,60.0

In [21]:
df_pivot.sort_values("received_time")

event,customer_id,offer_id,received_time,viewed_time,completed_time
56445,e39a6192c3a7476f86a2f15fbfeab53a,0b1e1539f2cc45b7b9fa7c272da2e1d7,0.0,48.0,18.0
63047,ff04e5e6410b4487bb1fc07bd10ef56e,ae264e3637204a6fb9bb56bc8210ddfd,0.0,12.0,NaN
63043,feff958c5a054bff98fc6d22ab4084b5,2298d6c36e964ae4a3e7e9706d1fb8c2,0.0,6.0,78.0
11094,2e2c0c6ab3974732b31ff74869932e84,f19421c1d4aa40978ebb69ca19b0e20d,0.0,36.0,72.0
63058,ff10813b5b234830a6c2a43ac7ae765e,4d5c57ea9a6940dd891ad53e9dbe8da0,0.0,0.0,NaN
...,...,...,...,...,...
63253,ffeaa02452ef451082a0361c3ca62ef5,ae264e3637204a6fb9bb56bc8210ddfd,576.0,624.0,612.0
63262,ffede3b700ac41d6a266fa1ba74b4f16,f19421c1d4aa40978ebb69ca19b0e20d,576.0,594.0,NaN
9262,27389f66304d483ba97a6afe011c702e,2298d6c36e964ae4a3e7e9706d1fb8c2,576.0,582.0,642.0
0,0009655768c64bdeb2e877511632db8f,2906b810c7d4411798c6938adc9daaa5,576.0,NaN,576.0
63279,fff8957ea8b240a6b5e634b6ee8eafcf,4d5c57ea9a6940dd891ad53e9dbe8da0,576.0,660.0,NaN

In [19]:
df_event.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 306137 entries, 0 to 306136
Data columns (total 6 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   customer_id  306137 non-null  object
 1   event        306137 non-null  object
 2   time         306137 non-null  int64
 3   offer_id     167184 non-null  object
 4   amount       138953 non-null  float64
 5   reward       33182 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 14.0+ MB

In [20]:
#check events for a single random customer_id
df_event[df_event.customer_id=="0082fd87c18f45f2be70dbcbb0fb8aad"]

,customer_id,event,time,offer_id,amount,reward
10597,0082fd87c18f45f2be70dbcbb0fb8aad,offer received,0,5a8bc65990b245e5a138643cd4eb9837,NaN,NaN
20396,0082fd87c18f45f2be70dbcbb0fb8aad,offer viewed,18,5a8bc65990b245e5a138643cd4eb9837,NaN,NaN
35625,0082fd87c18f45f2be70dbcbb0fb8aad,transaction,72,NaN,24.59,NaN
53958,0082fd87c18f45f2be70dbcbb0fb8aad,offer received,168,3f207df678b143eea3cee63160fa8bed,NaN,NaN
66048,0082fd87c18f45f2be70dbcbb0fb8aad,offer viewed,168,3f207df678b143eea3cee63160fa8bed,NaN,NaN
95171,0082fd87c18f45f2be70dbcbb0fb8aad,transaction,252,NaN,15.50,NaN
108972,0082fd87c18f45f2be70dbcbb0fb8aad,transaction,324,NaN,19.63,NaN
111612,0082fd87c18f45f2be70dbcbb0fb8aad,offer received,336,9b98b8c7a33c4b65b9aebfe6a799e6d9,NaN,NaN
130311,0082fd87c18f45f2be70dbcbb0fb8aad,offer viewed,348,9b98b8c7a33c4b65b9aebfe6a799e6d9,NaN,NaN
137564,0082fd87c18f45f2be70dbcbb0fb8aad,transaction,366,NaN,19.24,NaN
137565,0082fd87c18f45f2be70dbcbb0fb8aad,offer completed,366,9b98b8c7a33c4b65b9aebfe6a799e6d9,NaN,5.0
151397,0082fd87c18f45f2be70dbcbb0fb8aad,offer received,408,9b98b8c7a33c4b65b9aebfe6a799e6d9,NaN,NaN
184935,0082fd87c18f45f2be70dbcbb0fb8aad,transaction,450,NaN,8.95,NaN
184936,0082fd87c18f45f2be70dbcbb0fb8aad,offer completed,450,9b98b8c7a33c4b65b9aebfe6a799e6d9,NaN,5.0
202219,0082fd87c18f45f2be70dbcbb0fb8aad,offer received,504,3f207df678b143eea3cee63160fa8bed,NaN,NaN
237247,0082fd87c18f45f2be70dbcbb0fb8aad,transaction,552,NaN,20.74,NaN
285671,0082fd87c18f45f2be70dbcbb0fb8aad,offer viewed,636,3f207df678b143eea3cee63160fa8bed,NaN,NaN
301597,0082fd87c18f45f2be70dbcbb0fb8aad,transaction,696,NaN,13.20,NaN

1. One customer is getting multiple offer in different time period
2. we canâ€™t directly link a transaction to a specific offer unless we logically associate them within the offerâ€™s active window.

In [21]:
#lets check whether all customers got one offer at least
# All unique customer IDs
all_customers = set(df_event['customer_id'].unique())

# Those who received offers
received_customers = set(df_event[df_event['event'] == 'offer received']['customer_id'])

# Those who never received an offer
no_offer_customers = all_customers - received_customers

# Double-check
print(f"Total in df_event: {len(all_customers)}")
print(f"Received offers: {len(received_customers)}")
print(f"Did NOT receive offers: {len(no_offer_customers)}")
print(f"Sum: {len(received_customers) + len(no_offer_customers)}")

Total in df_event: 17000
Received offers: 16994
Did NOT receive offers: 6
Sum: 17000

In [22]:
#lets check offer_viewed status

# All unique customers from df_event
all_customers = set(df_event['customer_id'].unique())

# Customers who viewed at least one offer
viewed_customers = set(df_event[df_event['event'] == 'offer viewed']['customer_id'])

# Customers who never viewed an offer
no_view_customers = all_customers - viewed_customers

# Output the counts
print(f"Total customers in df_event: {len(all_customers)}")
print(f"Customers who viewed at least one offer: {len(viewed_customers)}")
print(f"Customers who did NOT view any offer: {len(no_view_customers)}")
print(f"Sum: {len(viewed_customers) + len(no_view_customers)}")

Total customers in df_event: 17000
Customers who viewed at least one offer: 16834
Customers who did NOT view any offer: 166
Sum: 17000

In [23]:
#lets check offer_completed status

# All unique customers from df_event
all_customers = set(df_event['customer_id'].unique())

# Customers who completed at least one offer
completed_customers = set(df_event[df_event['event'] == 'offer completed']['customer_id'])

# Customers who never viewed an offer
no_completed_customers = all_customers - completed_customers

# Output the counts
print(f"Total customers in df_event: {len(all_customers)}")
print(f"Customers who completed at least one offer: {len(completed_customers)}")
print(f"Customers who did NOT complete any offer: {len(no_completed_customers)}")
print(f"Sum: {len(completed_customers) + len(no_completed_customers)}")

Total customers in df_event: 17000
Customers who completed at least one offer: 12774
Customers who did NOT complete any offer: 4226
Sum: 17000

In [24]:
total_received = df_event[df_event['event'] == 'offer received'].shape[0]
total_viewed   = df_event[df_event['event'] == 'offer viewed'].shape[0]
total_completed = df_event[df_event['event'] == 'offer completed'].shape[0]
total_transaction=df_event[df_event['event'] == 'transaction'].shape[0]

print(f"Total offers received: {total_received}")
print(f"Total offers viewed: {total_viewed}")
print(f"Total offers completed: {total_completed}")
print(f"Total Transaction: {total_transaction}")

Total offers received: 76277
Total offers viewed: 57725
Total offers completed: 33182
Total Transaction: 138953

In [25]:
#main objective is now to get offer status in one row for each customer for a specific offer_id
# Filter received event type
df_received = df_event[df_event['event'] == 'offer received'][['customer_id', 'offer_id', 'time']]
df_received.rename(columns={'time': 'received_time'}, inplace=True)
df_received.shape

(76277, 3)

In [26]:
# Filter viewed event type
df_viewed = df_event[df_event['event'] == 'offer viewed'][['customer_id', 'offer_id', 'time']]
df_viewed.rename(columns={'time': 'viewed_time'}, inplace=True)
df_viewed.shape

(57725, 3)

In [27]:
# Filter completed event type
df_completed = df_event[df_event['event'] == 'offer completed'][['customer_id', 'offer_id', 'time']]
df_completed.rename(columns={'time': 'completed_time'}, inplace=True)
df_completed.shape

(33182, 3)

In [28]:
# Filter transaction event type
df_transaction = df_event[df_event['event'] == 'transaction'][['customer_id', 'time',"amount"]]
df_transaction.rename(columns={'time': 'transaction_time'}, inplace=True)
df_transaction.shape

(138953, 3)

In [29]:
# Merge df_received and df_viewed
df_lifecycle = pd.merge(df_received, df_viewed, on=['customer_id', 'offer_id'],how="outer")
df_lifecycle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 95321 entries, 0 to 95320
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    95321 non-null  object
 1   offer_id       95321 non-null  object
 2   received_time  95321 non-null  int64
 3   viewed_time    79329 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.9+ MB

In [30]:
# Merge df_lifecycle and df_completed
df_lifecycle = pd.merge(df_lifecycle, df_completed, on=['customer_id', 'offer_id'],how="outer")
df_lifecycle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 113934 entries, 0 to 113933
Data columns (total 5 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   customer_id     113934 non-null  object
 1   offer_id        113934 non-null  object
 2   received_time   113934 non-null  int64
 3   viewed_time     97380 non-null   float64
 4   completed_time  65722 non-null   float64
dtypes: float64(2), int64(1), object(2)
memory usage: 4.3+ MB

In [31]:
# Merge df_lifecycle and df_transaction
df_lifecycle = pd.merge(df_lifecycle, df_transaction, on=['customer_id'],how="outer")
df_lifecycle

,customer_id,offer_id,received_time,viewed_time,completed_time,transaction_time,amount
0,0009655768c64bdeb2e877511632db8f,2906b810c7d4411798c6938adc9daaa5,576.0,NaN,576.0,228.0,22.16
1,0009655768c64bdeb2e877511632db8f,2906b810c7d4411798c6938adc9daaa5,576.0,NaN,576.0,414.0,8.57
2,0009655768c64bdeb2e877511632db8f,2906b810c7d4411798c6938adc9daaa5,576.0,NaN,576.0,528.0,14.11
3,0009655768c64bdeb2e877511632db8f,2906b810c7d4411798c6938adc9daaa5,576.0,NaN,576.0,552.0,13.56
4,0009655768c64bdeb2e877511632db8f,2906b810c7d4411798c6938adc9daaa5,576.0,NaN,576.0,576.0,10.27
...,...,...,...,...,...,...,...
1021023,ffff82501cea40309d5fdd7edcca4a07,fafdcd668e3743c1bb461111dcafc2a4,0.0,6.0,60.0,498.0,13.17
1021024,ffff82501cea40309d5fdd7edcca4a07,fafdcd668e3743c1bb461111dcafc2a4,0.0,6.0,60.0,504.0,7.79
1021025,ffff82501cea40309d5fdd7edcca4a07,fafdcd668e3743c1bb461111dcafc2a4,0.0,6.0,60.0,576.0,14.23
1021026,ffff82501cea40309d5fdd7edcca4a07,fafdcd668e3743c1bb461111dcafc2a4,0.0,6.0,60.0,606.0,10.12
1021027,ffff82501cea40309d5fdd7edcca4a07,fafdcd668e3743c1bb461111dcafc2a4,0.0,6.0,60.0,648.0,18.91

In [32]:
df_check=df_lifecycle[df_lifecycle.completed_time==df_lifecycle.transaction_time]
df_check

,customer_id,offer_id,received_time,viewed_time,completed_time,transaction_time,amount
4,0009655768c64bdeb2e877511632db8f,2906b810c7d4411798c6938adc9daaa5,576.0,NaN,576.0,576.0,10.27
25,0009655768c64bdeb2e877511632db8f,f19421c1d4aa40978ebb69ca19b0e20d,408.0,456.0,414.0,414.0,8.57
34,0009655768c64bdeb2e877511632db8f,fafdcd668e3743c1bb461111dcafc2a4,504.0,540.0,528.0,528.0,14.11
54,0011e0d4e6b944f998e987f904e8c1e5,0b1e1539f2cc45b7b9fa7c272da2e1d7,408.0,432.0,576.0,576.0,22.05
58,0011e0d4e6b944f998e987f904e8c1e5,2298d6c36e964ae4a3e7e9706d1fb8c2,168.0,186.0,252.0,252.0,11.93
...,...,...,...,...,...,...,...
1020961,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,576.0,582.0,384.0,384.0,15.57
1020977,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,576.0,582.0,414.0,414.0,17.55
1020995,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,576.0,582.0,576.0,576.0,14.23
1021009,ffff82501cea40309d5fdd7edcca4a07,9b98b8c7a33c4b65b9aebfe6a799e6d9,504.0,534.0,504.0,504.0,7.79
1021013,ffff82501cea40309d5fdd7edcca4a07,fafdcd668e3743c1bb461111dcafc2a4,0.0,6.0,60.0,60.0,16.06

In [33]:
# Check lifecycle order validity: received_time < viewed_time < completed_time
df_check['valid_path'] = (
    (df_check['viewed_time'].isna() | (df_check['viewed_time'] >= df_check['received_time']))
) & (
    df_check['completed_time'] >= df_check['received_time']
)

# Fill NaNs in valid_path as False (e.g. missing view or complete)
df_check['valid_path'].fillna(False, inplace=True)

df_check

,customer_id,offer_id,received_time,viewed_time,completed_time,transaction_time,amount,valid_path
4,0009655768c64bdeb2e877511632db8f,2906b810c7d4411798c6938adc9daaa5,576.0,NaN,576.0,576.0,10.27,True
25,0009655768c64bdeb2e877511632db8f,f19421c1d4aa40978ebb69ca19b0e20d,408.0,456.0,414.0,414.0,8.57,True
34,0009655768c64bdeb2e877511632db8f,fafdcd668e3743c1bb461111dcafc2a4,504.0,540.0,528.0,528.0,14.11,True
54,0011e0d4e6b944f998e987f904e8c1e5,0b1e1539f2cc45b7b9fa7c272da2e1d7,408.0,432.0,576.0,576.0,22.05,True
58,0011e0d4e6b944f998e987f904e8c1e5,2298d6c36e964ae4a3e7e9706d1fb8c2,168.0,186.0,252.0,252.0,11.93,True
...,...,...,...,...,...,...,...,...
1020961,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,576.0,582.0,384.0,384.0,15.57,False
1020977,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,576.0,582.0,414.0,414.0,17.55,False
1020995,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,576.0,582.0,576.0,576.0,14.23,True
1021009,ffff82501cea40309d5fdd7edcca4a07,9b98b8c7a33c4b65b9aebfe6a799e6d9,504.0,534.0,504.0,504.0,7.79,True
1021013,ffff82501cea40309d5fdd7edcca4a07,fafdcd668e3743c1bb461111dcafc2a4,0.0,6.0,60.0,60.0,16.06,True

In [34]:
#drop rows where vaid path is false
df_cg = df_check[df_check['valid_path'] == True].copy()

#reset index for cleaner display
df_cg.reset_index(drop=True, inplace=True)

# Preview the cleaned, valid offer lifecycle data
df_cg

,customer_id,offer_id,received_time,viewed_time,completed_time,transaction_time,amount,valid_path
0,0009655768c64bdeb2e877511632db8f,2906b810c7d4411798c6938adc9daaa5,576.0,NaN,576.0,576.0,10.27,True
1,0009655768c64bdeb2e877511632db8f,f19421c1d4aa40978ebb69ca19b0e20d,408.0,456.0,414.0,414.0,8.57,True
2,0009655768c64bdeb2e877511632db8f,fafdcd668e3743c1bb461111dcafc2a4,504.0,540.0,528.0,528.0,14.11,True
3,0011e0d4e6b944f998e987f904e8c1e5,0b1e1539f2cc45b7b9fa7c272da2e1d7,408.0,432.0,576.0,576.0,22.05,True
4,0011e0d4e6b944f998e987f904e8c1e5,2298d6c36e964ae4a3e7e9706d1fb8c2,168.0,186.0,252.0,252.0,11.93,True
...,...,...,...,...,...,...,...,...
48844,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,408.0,582.0,414.0,414.0,17.55,True
48845,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,408.0,582.0,576.0,576.0,14.23,True
48846,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,576.0,582.0,576.0,576.0,14.23,True
48847,ffff82501cea40309d5fdd7edcca4a07,9b98b8c7a33c4b65b9aebfe6a799e6d9,504.0,534.0,504.0,504.0,7.79,True
48848,ffff82501cea40309d5fdd7edcca4a07,fafdcd668e3743c1bb461111dcafc2a4,0.0,6.0,60.0,60.0,16.06,True

In [35]:
#as duration is an important element to get valid data, add duration from df_offer 
#  Add duration info to valid offers
df_cg = df_cg.merge(df_offer[['offer_id', 'duration']], on='offer_id', how='left')

# Calculate offer window
df_cg['offer_end_time'] = df_cg['received_time'] + (df_cg['duration']*24)

# Keep only transactions within the offer window
df_cg_final = df_cg[
    (df_cg['completed_time'] <= df_cg['offer_end_time'])
]
df_cg_final

,customer_id,offer_id,received_time,viewed_time,completed_time,transaction_time,amount,valid_path,duration,offer_end_time
0,0009655768c64bdeb2e877511632db8f,2906b810c7d4411798c6938adc9daaa5,576.0,NaN,576.0,576.0,10.27,True,7,744.0
1,0009655768c64bdeb2e877511632db8f,f19421c1d4aa40978ebb69ca19b0e20d,408.0,456.0,414.0,414.0,8.57,True,5,528.0
2,0009655768c64bdeb2e877511632db8f,fafdcd668e3743c1bb461111dcafc2a4,504.0,540.0,528.0,528.0,14.11,True,10,744.0
3,0011e0d4e6b944f998e987f904e8c1e5,0b1e1539f2cc45b7b9fa7c272da2e1d7,408.0,432.0,576.0,576.0,22.05,True,10,648.0
4,0011e0d4e6b944f998e987f904e8c1e5,2298d6c36e964ae4a3e7e9706d1fb8c2,168.0,186.0,252.0,252.0,11.93,True,7,336.0
...,...,...,...,...,...,...,...,...,...,...
48844,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,408.0,582.0,414.0,414.0,17.55,True,7,576.0
48845,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,408.0,582.0,576.0,576.0,14.23,True,7,576.0
48846,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,576.0,582.0,576.0,576.0,14.23,True,7,744.0
48847,ffff82501cea40309d5fdd7edcca4a07,9b98b8c7a33c4b65b9aebfe6a799e6d9,504.0,534.0,504.0,504.0,7.79,True,7,672.0
48848,ffff82501cea40309d5fdd7edcca4a07,fafdcd668e3743c1bb461111dcafc2a4,0.0,6.0,60.0,60.0,16.06,True,10,240.0

In [36]:
# Get rows that are duplicates based on the specified columns
duplicate_rows = df_cg_final[df_cg_final.duplicated(subset=['customer_id', 'offer_id', 'received_time', 'viewed_time'], keep=False)]
duplicate_rows

,customer_id,offer_id,received_time,viewed_time,completed_time,transaction_time,amount,valid_path,duration,offer_end_time
42,0082fd87c18f45f2be70dbcbb0fb8aad,9b98b8c7a33c4b65b9aebfe6a799e6d9,336.0,348.0,366.0,366.0,19.24,True,7,504.0
43,0082fd87c18f45f2be70dbcbb0fb8aad,9b98b8c7a33c4b65b9aebfe6a799e6d9,336.0,348.0,450.0,450.0,8.95,True,7,504.0
130,00e20b4ca129458aaab0f4727ef3513a,fafdcd668e3743c1bb461111dcafc2a4,408.0,408.0,426.0,426.0,10.05,True,10,648.0
131,00e20b4ca129458aaab0f4727ef3513a,fafdcd668e3743c1bb461111dcafc2a4,408.0,408.0,618.0,618.0,125.32,True,10,648.0
132,00e20b4ca129458aaab0f4727ef3513a,fafdcd668e3743c1bb461111dcafc2a4,408.0,594.0,426.0,426.0,10.05,True,10,648.0
...,...,...,...,...,...,...,...,...,...,...
48840,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,336.0,582.0,414.0,414.0,17.55,True,7,504.0
48842,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,408.0,414.0,414.0,414.0,17.55,True,7,576.0
48843,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,408.0,414.0,576.0,576.0,14.23,True,7,576.0
48844,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,408.0,582.0,414.0,414.0,17.55,True,7,576.0
48845,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,408.0,582.0,576.0,576.0,14.23,True,7,576.0

In [37]:
# Get rows that are duplicates based on the specified columns
duplicate_rows = df_cg_final[df_cg_final.duplicated(subset=['customer_id', 'offer_id', 'viewed_time', 'completed_time'], keep=False)]
duplicate_rows

,customer_id,offer_id,received_time,viewed_time,completed_time,transaction_time,amount,valid_path,duration,offer_end_time
123,00d7c95f793a4212af44e632fdc1e431,2906b810c7d4411798c6938adc9daaa5,336.0,NaN,504.0,504.0,18.58,True,7,504.0
124,00d7c95f793a4212af44e632fdc1e431,2906b810c7d4411798c6938adc9daaa5,504.0,NaN,504.0,504.0,18.58,True,7,672.0
133,00e20b4ca129458aaab0f4727ef3513a,fafdcd668e3743c1bb461111dcafc2a4,408.0,594.0,618.0,618.0,125.32,True,10,648.0
134,00e20b4ca129458aaab0f4727ef3513a,fafdcd668e3743c1bb461111dcafc2a4,576.0,594.0,618.0,618.0,125.32,True,10,816.0
138,00e9f403afa641889cd034ee7c7ca6e9,0b1e1539f2cc45b7b9fa7c272da2e1d7,408.0,504.0,540.0,540.0,13.10,True,10,648.0
...,...,...,...,...,...,...,...,...,...,...
48840,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,336.0,582.0,414.0,414.0,17.55,True,7,504.0
48842,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,408.0,414.0,414.0,414.0,17.55,True,7,576.0
48844,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,408.0,582.0,414.0,414.0,17.55,True,7,576.0
48845,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,408.0,582.0,576.0,576.0,14.23,True,7,576.0
48846,ffff82501cea40309d5fdd7edcca4a07,2906b810c7d4411798c6938adc9daaa5,576.0,582.0,576.0,576.0,14.23,True,7,744.0

In [36]:
df_cg[df_cg.transaction_time.isna()]

Empty DataFrame
Columns: [customer_id, offer_id, received_time, viewed_time, completed_time, transaction_time, amount, valid_path]
Index: []

In [31]:
#see df_lifecycle_data
df_lifecycle.head()

,customer_id,offer_id,received_time,viewed_time,completed_time
0,0009655768c64bdeb2e877511632db8f,2906b810c7d4411798c6938adc9daaa5,576,NaN,576.0
1,0009655768c64bdeb2e877511632db8f,3f207df678b143eea3cee63160fa8bed,336,372.0,NaN
2,0009655768c64bdeb2e877511632db8f,5a8bc65990b245e5a138643cd4eb9837,168,192.0,NaN
3,0009655768c64bdeb2e877511632db8f,f19421c1d4aa40978ebb69ca19b0e20d,408,456.0,414.0
4,0009655768c64bdeb2e877511632db8f,fafdcd668e3743c1bb461111dcafc2a4,504,540.0,528.0

In [32]:
# Add offer_type for context
df_lifecycle = df_lifecycle.merge(df_offer[['offer_id', 'offer_combo']], on='offer_id', how='left')
df_lifecycle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 113934 entries, 0 to 113933
Data columns (total 6 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   customer_id     113934 non-null  object
 1   offer_id        113934 non-null  object
 2   received_time   113934 non-null  int64
 3   viewed_time     97380 non-null   float64
 4   completed_time  65722 non-null   float64
 5   offer_combo     113934 non-null  object
dtypes: float64(2), int64(1), object(3)
memory usage: 5.2+ MB

In [33]:
# Check lifecycle order validity: received_time < viewed_time < completed_time
df_lifecycle['valid_path'] = (
    df_lifecycle['viewed_time'] >= df_lifecycle['received_time']
) & (
    df_lifecycle['completed_time'] >= df_lifecycle['received_time']
)

# Fill NaNs in valid_path as False (e.g. missing view or complete)
df_lifecycle['valid_path'].fillna(False, inplace=True)

df_lifecycle.sample(5)

,customer_id,offer_id,received_time,viewed_time,completed_time,offer_combo,valid_path
38526,5682c5153c7d4ef7b3eb08208c546dde,5a8bc65990b245e5a138643cd4eb9837,504,618.0,NaN,informational-0-0-3,False
8270,13033baa9d294c3c9165a00d71b72614,2298d6c36e964ae4a3e7e9706d1fb8c2,336,168.0,228.0,discount-7-3-7,False
65208,924dd5009ef945d6816d0577cdcc0cd5,2906b810c7d4411798c6938adc9daaa5,504,186.0,552.0,discount-10-2-7,False
24583,37a97f6e09784a07bbb67bc6539f1a00,3f207df678b143eea3cee63160fa8bed,168,6.0,NaN,informational-0-0-4,False
38494,56630668a08842a38f32bf4f7bfa4125,2906b810c7d4411798c6938adc9daaa5,576,12.0,12.0,discount-10-2-7,False

In [34]:
#drop rows where vaid path is false
df_valid = df_lifecycle[df_lifecycle['valid_path'] == True].copy()

#reset index for cleaner display
df_valid.reset_index(drop=True, inplace=True)

# Preview the cleaned, valid offer lifecycle data
df_valid.head()

,customer_id,offer_id,received_time,viewed_time,completed_time,offer_combo,valid_path
0,0009655768c64bdeb2e877511632db8f,f19421c1d4aa40978ebb69ca19b0e20d,408,456.0,414.0,bogo-5-5-5,True
1,0009655768c64bdeb2e877511632db8f,fafdcd668e3743c1bb461111dcafc2a4,504,540.0,528.0,discount-10-2-10,True
2,0011e0d4e6b944f998e987f904e8c1e5,0b1e1539f2cc45b7b9fa7c272da2e1d7,408,432.0,576.0,discount-20-5-10,True
3,0011e0d4e6b944f998e987f904e8c1e5,2298d6c36e964ae4a3e7e9706d1fb8c2,168,186.0,252.0,discount-7-3-7,True
4,0011e0d4e6b944f998e987f904e8c1e5,9b98b8c7a33c4b65b9aebfe6a799e6d9,504,516.0,576.0,bogo-5-5-7,True

In [35]:
df_valid.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43507 entries, 0 to 43506
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     43507 non-null  object
 1   offer_id        43507 non-null  object
 2   received_time   43507 non-null  int64
 3   viewed_time     43507 non-null  float64
 4   completed_time  43507 non-null  float64
 5   offer_combo     43507 non-null  object
 6   valid_path      43507 non-null  bool
dtypes: bool(1), float64(2), int64(1), object(3)
memory usage: 2.0+ MB

In [36]:
#as duration is an important element to get valid data, add duration from df_offer 
#  Add duration info to valid offers
df_valid = df_valid.merge(df_offer[['offer_id', 'duration']], on='offer_id', how='left')

# Calculate offer window
df_valid['offer_end_time'] = df_valid['received_time'] + (df_valid['duration']*24)

# Keep only transactions within the offer window
df_valid_final = df_valid[
    (df_valid['completed_time'] <= df_valid['offer_end_time'])
]
df_valid_final.head()

,customer_id,offer_id,received_time,viewed_time,completed_time,offer_combo,valid_path,duration,offer_end_time
0,0009655768c64bdeb2e877511632db8f,f19421c1d4aa40978ebb69ca19b0e20d,408,456.0,414.0,bogo-5-5-5,True,5,528
1,0009655768c64bdeb2e877511632db8f,fafdcd668e3743c1bb461111dcafc2a4,504,540.0,528.0,discount-10-2-10,True,10,744
2,0011e0d4e6b944f998e987f904e8c1e5,0b1e1539f2cc45b7b9fa7c272da2e1d7,408,432.0,576.0,discount-20-5-10,True,10,648
3,0011e0d4e6b944f998e987f904e8c1e5,2298d6c36e964ae4a3e7e9706d1fb8c2,168,186.0,252.0,discount-7-3-7,True,7,336
4,0011e0d4e6b944f998e987f904e8c1e5,9b98b8c7a33c4b65b9aebfe6a799e6d9,504,516.0,576.0,bogo-5-5-7,True,7,672

In [37]:
#drop unnecessary column
df_event_alter = df_valid_final.drop(columns=['valid_path', 'duration',"offer_end_time"])
df_event_alter.head()

,customer_id,offer_id,received_time,viewed_time,completed_time,offer_combo
0,0009655768c64bdeb2e877511632db8f,f19421c1d4aa40978ebb69ca19b0e20d,408,456.0,414.0,bogo-5-5-5
1,0009655768c64bdeb2e877511632db8f,fafdcd668e3743c1bb461111dcafc2a4,504,540.0,528.0,discount-10-2-10
2,0011e0d4e6b944f998e987f904e8c1e5,0b1e1539f2cc45b7b9fa7c272da2e1d7,408,432.0,576.0,discount-20-5-10
3,0011e0d4e6b944f998e987f904e8c1e5,2298d6c36e964ae4a3e7e9706d1fb8c2,168,186.0,252.0,discount-7-3-7
4,0011e0d4e6b944f998e987f904e8c1e5,9b98b8c7a33c4b65b9aebfe6a799e6d9,504,516.0,576.0,bogo-5-5-7

In [38]:
#get shape
df_event_alter.shape

(34373, 6)

In [39]:
# Merge on customer_id
df_with_txns = df_event_alter.merge(
    df_transaction,
    on='customer_id',
    how='left'
)

In [40]:

# Filter to only include transactions within the offer window
mask = (
    (df_with_txns['transaction_time'] >= df_with_txns['received_time']) &
    (df_with_txns['transaction_time'] == df_with_txns['completed_time'])
)

df_with_txns= df_with_txns[mask]

#get sample
df_with_txns.head()

,customer_id,offer_id,received_time,viewed_time,completed_time,offer_combo,transaction_time,amount
1,0009655768c64bdeb2e877511632db8f,f19421c1d4aa40978ebb69ca19b0e20d,408,456.0,414.0,bogo-5-5-5,414,8.57
10,0009655768c64bdeb2e877511632db8f,fafdcd668e3743c1bb461111dcafc2a4,504,540.0,528.0,discount-10-2-10,528,14.11
18,0011e0d4e6b944f998e987f904e8c1e5,0b1e1539f2cc45b7b9fa7c272da2e1d7,408,432.0,576.0,discount-20-5-10,576,22.05
22,0011e0d4e6b944f998e987f904e8c1e5,2298d6c36e964ae4a3e7e9706d1fb8c2,168,186.0,252.0,discount-7-3-7,252,11.93
28,0011e0d4e6b944f998e987f904e8c1e5,9b98b8c7a33c4b65b9aebfe6a799e6d9,504,516.0,576.0,bogo-5-5-7,576,22.05

In [41]:
df_with_txns.shape

(34373, 8)

In [42]:
#rename
df_offer_response = df_with_txns

In [43]:
#save file
df_offer_response.to_csv('offer_response_data.csv', index=False)

In [44]:
#converstion funnel duration analysis
df_offer_response['time_to_view'] = df_offer_response['viewed_time'] - df_offer_response['received_time']
df_offer_response['time_to_complete'] = df_offer_response['completed_time'] - df_offer_response['viewed_time']
df_offer_response.head()

,customer_id,offer_id,received_time,viewed_time,completed_time,offer_combo,transaction_time,amount,time_to_view,time_to_complete
2,0011e0d4e6b944f998e987f904e8c1e5,0b1e1539f2cc45b7b9fa7c272da2e1d7,408,432.0,576.0,discount-20-5-10,576,22.05,24.0,144.0
6,0011e0d4e6b944f998e987f904e8c1e5,2298d6c36e964ae4a3e7e9706d1fb8c2,168,186.0,252.0,discount-7-3-7,252,11.93,18.0,66.0
12,0011e0d4e6b944f998e987f904e8c1e5,9b98b8c7a33c4b65b9aebfe6a799e6d9,504,516.0,576.0,bogo-5-5-7,576,22.05,12.0,60.0
19,0020c2b971eb4e9188eac86d93036a77,4d5c57ea9a6940dd891ad53e9dbe8da0,408,426.0,510.0,bogo-10-10-5,510,17.24,18.0,84.0
23,0020c2b971eb4e9188eac86d93036a77,fafdcd668e3743c1bb461111dcafc2a4,0,12.0,54.0,discount-10-2-10,54,17.63,12.0,42.0

In [45]:
#Get Average Duration at Each Funnel Stage
avg_durations = df_offer_response[['time_to_view', 'time_to_complete']].mean().round(2)
print(avg_durations)

time_to_view        21.46
time_to_complete    47.63
dtype: float64

In [46]:
#Performance by offer_combo
offer_summary=df_offer_response.groupby('offer_combo').agg({
    'customer_id': 'count',
    'amount': ['sum', 'mean'],
    'time_to_view':'mean',
    'time_to_complete': 'mean'
}).rename(columns={'customer_id': 'total_completed'})

offer_summary_sorted=offer_summary.sort_values(('amount', 'sum'), ascending=False)
offer_summary_sorted

                 total_completed    amount            time_to_view  \
                           count       sum       mean         mean
offer_combo
discount-10-2-10            5287  94581.04  17.889359    24.223567
discount-7-3-7              4657  78653.25  16.889253    18.105647
bogo-5-5-5                  3660  72459.78  19.797754    15.265574
bogo-10-10-5                2864  67972.34  23.733359    14.748603
bogo-10-10-7                2750  65053.78  23.655920    20.958545
discount-10-2-7             2281  45355.33  19.883968    25.530907
bogo-5-5-7                  2249  40038.36  17.802739    24.893731
discount-20-5-10            1466  37698.43  25.715164    39.990450

                 time_to_complete
                             mean
offer_combo
discount-10-2-10        65.366749
discount-7-3-7          47.796435
bogo-5-5-5              33.267213
bogo-10-10-5            34.026536
bogo-10-10-7            42.750545
discount-10-2-7         45.524770
bogo-5-5-7              41.426412
discount-20-5-10        67.571623

In [47]:
#conversion rate by offer_combo
# Filter received events and map offer_combo from df_offer
df_received = df_event[df_event['event'] == 'offer received'].copy()
df_received = df_received.merge(df_offer[['offer_id', 'offer_combo']], on='offer_id', how='left')

received_counts = df_received.groupby('offer_combo')['customer_id'].count().rename('offers_received')

received_counts

offer_combo
bogo-10-10-5           7593
bogo-10-10-7           7658
bogo-5-5-5             7571
bogo-5-5-7             7677
discount-10-2-10       7597
discount-10-2-7        7632
discount-20-5-10       7668
discount-7-3-7         7646
informational-0-0-3    7618
informational-0-0-4    7617
Name: offers_received, dtype: int64

In [48]:
#Count completed offers per offer_combo
completed_counts = df_offer_response.groupby('offer_combo')['customer_id'].count().rename('offers_completed')
completed_counts

offer_combo
bogo-10-10-5        2864
bogo-10-10-7        2750
bogo-5-5-5          3660
bogo-5-5-7          2249
discount-10-2-10    5287
discount-10-2-7     2281
discount-20-5-10    1466
discount-7-3-7      4657
Name: offers_completed, dtype: int64

In [49]:
conversion_df = pd.concat([received_counts, completed_counts], axis=1).fillna(0)

conversion_df['conversion_rate'] = ((conversion_df['offers_completed'] / conversion_df['offers_received'])*100).round(3)
conversion_df = conversion_df.sort_values('conversion_rate', ascending=False)

conversion_df

                     offers_received  offers_completed  conversion_rate
offer_combo
discount-10-2-10                7597            5287.0           69.593
discount-7-3-7                  7646            4657.0           60.908
bogo-5-5-5                      7571            3660.0           48.342
bogo-10-10-5                    7593            2864.0           37.719
bogo-10-10-7                    7658            2750.0           35.910
discount-10-2-7                 7632            2281.0           29.887
bogo-5-5-7                      7677            2249.0           29.295
discount-20-5-10                7668            1466.0           19.118
informational-0-0-3             7618               0.0            0.000
informational-0-0-4             7617               0.0            0.000

In [50]:
df_offer_response = df_offer_response.merge(
    df_offer[['offer_id', 'reward']],
    on='offer_id',
    how='left'
)
df_offer_response.head()

,customer_id,offer_id,received_time,viewed_time,completed_time,offer_combo,transaction_time,amount,time_to_view,time_to_complete,reward
0,0011e0d4e6b944f998e987f904e8c1e5,0b1e1539f2cc45b7b9fa7c272da2e1d7,408,432.0,576.0,discount-20-5-10,576,22.05,24.0,144.0,5
1,0011e0d4e6b944f998e987f904e8c1e5,2298d6c36e964ae4a3e7e9706d1fb8c2,168,186.0,252.0,discount-7-3-7,252,11.93,18.0,66.0,3
2,0011e0d4e6b944f998e987f904e8c1e5,9b98b8c7a33c4b65b9aebfe6a799e6d9,504,516.0,576.0,bogo-5-5-7,576,22.05,12.0,60.0,5
3,0020c2b971eb4e9188eac86d93036a77,4d5c57ea9a6940dd891ad53e9dbe8da0,408,426.0,510.0,bogo-10-10-5,510,17.24,18.0,84.0,10
4,0020c2b971eb4e9188eac86d93036a77,fafdcd668e3743c1bb461111dcafc2a4,0,12.0,54.0,discount-10-2-10,54,17.63,12.0,42.0,2

In [51]:
# Group by offer_combo and calculate revenue and cost
roi_df = df_offer_response.groupby('offer_combo').agg({
    'amount': 'sum',           # Total revenue
    'reward': 'sum'            # Total cost to the cafe
}).rename(columns={'amount': 'total_revenue', 'reward': 'total_cost'})

roi_df

                  total_revenue  total_cost
offer_combo
bogo-10-10-5           67972.34       28640
bogo-10-10-7           65053.78       27500
bogo-5-5-5             72459.78       18300
bogo-5-5-7             40038.36       11245
discount-10-2-10       94581.04       10574
discount-10-2-7        45355.33        4562
discount-20-5-10       37698.43        7330
discount-7-3-7         78653.25       13971

In [52]:
# Calculate ROI
roi_df['roi_percent'] = ((roi_df['total_revenue'] - roi_df['total_cost']) / roi_df['total_cost']) * 100

# Round for cleaner presentation
roi_df = roi_df.round({'roi_percent': 2})

roi_df = roi_df.sort_values('roi_percent', ascending=False)
roi_df

                  total_revenue  total_cost  roi_percent
offer_combo
discount-10-2-7        45355.33        4562       894.20
discount-10-2-10       94581.04       10574       794.47
discount-7-3-7         78653.25       13971       462.98
discount-20-5-10       37698.43        7330       414.30
bogo-5-5-5             72459.78       18300       295.96
bogo-5-5-7             40038.36       11245       256.05
bogo-10-10-5           67972.34       28640       137.33
bogo-10-10-7           65053.78       27500       136.56

In [53]:
# First, merge offer_type into df_offer_response
df_offer_response = df_offer_response.merge(
    df_offer[['offer_id', 'offer_type']],
    on='offer_id',
    how='left'
)

# Filter reward offers
reward_offers_df = df_offer_response[df_offer_response['offer_type'].isin(['bogo', 'discount'])]

# Count how many reward offers were completed
total_completed_rewards = reward_offers_df['offer_id'].nunique()  # OR len(reward_offers_df)

print("Total reward offers completed:", total_completed_rewards)

Total reward offers completed: 8